of60/tutorials/rheoEFoam/channelEDF/PowerLaw/NernstPlanck/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;

libs ("libsampling.so");
      
setFormat raw;

surfaceFormat raw;

formatOptions
{
    ensight
    {
        format  ascii;
    }
}

interpolationScheme cellPointFace;

fields
(
   U  
);

sets
(

    lineY
    {
        type        lineFace;
        axis        y;

        start       ( 7.5e-6 -1e-6 5e-6 );
        end         ( 7.5e-6 100e-6 5e-6 );
       
    }
 
);

surfaces
(

);

